<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
    <title>Optez pour le Markdown !</title>
    <meta name="description" content="">
    <meta name="keywords" content="HTML,CSS,XML,JavaScript">
    <meta name="viewport" content="width=device-width">

    <link rel="stylesheet" href="/css/vendors.min.css">
    <link rel="stylesheet" href="/css/types.css">
    <link rel="stylesheet" href="/css/main.css">

    <script src="https://use.typekit.net/cwx4xcg.js"></script>
    <script>try{Typekit.load({ async: true });}catch(e){}</script>

    <!--[if lt IE 9]>
      <script src="//html5shiv.googlecode.com/svn/trunk/html5.js"></script>
    <![endif]-->
  </head>
  <body>
    
  <img src="/img/cover/optez-pour le markdown !.jpg" class="cover">
  <div class="article-container">
    <div class="text-center">
      <h1>Optez pour le Markdown !</h1>
      <div class="date">
        06.06.2014 &bullet; Yann Gouffon
      </div>
    </div>

    <article>
      <p>Plus l&#xE9;ger que l&apos;HTML, le Markdown est un langage qui a gagn&#xE9; en popularit&#xE9; ses derni&#xE8;res ann&#xE9;es. Tr&#xE8;s appr&#xE9;ci&#xE9; par la plupart des r&#xE9;dacteurs digitaux, il offre la possibilit&#xE9; de formater ais&#xE9;ment un texte gr&#xE2;ce &#xE0; une syntaxe discr&#xE8;te et  facile &#xE0; prendre en main.</p>
<h2 id="sa-cr-ation">Sa cr&#xE9;ation</h2>
<p>Cr&#xE9;&#xE9; par <a href="http://fr.wikipedia.org/wiki/John_Gruber">John Gruber</a> et <a href="http://fr.wikipedia.org/wiki/Aaron_Swartz">Aaron Swartz</a> en 2004, le Markdown a pour but d&apos;offrir une syntaxe facile &#xE0; lire et &#xE0; &#xE9;crire. Souvent converti dans sa finalit&#xE9;, il est ainsi lisible sous forme de page web (HTML) ou de &quot;plain text&quot;. En opposition avec la r&#xE9;daction WYSIWYG (What you see is what you get) qui utilise un formatage plus ou moins automatique, l&apos;utilisateur doit formater le Markdown manuellement par l&apos;ajout de signes dans son texte.</p>
<h2 id="une-popularit-croissante">Une popularit&#xE9; croissante</h2>
<p>Il n&apos;est, bien entendu, pas le premier de son genre, mais sa popularit&#xE9; fait de lui le poids lourd de la cat&#xE9;gorie des langages de balisage l&#xE9;ger. Avec la multiplication de tr&#xE8;s bons &#xE9;diteurs Markdown comme <a href="http://writer.pro/">Writer</a>, <a href="http://bywordapp.com/">Byword</a>, <a href="http://writeapp.net/mac/">Write</a> et <a href="http://mouapp.com/">Mou</a>, le langage est devenu l&apos;apanage des r&#xE9;dacteurs digitaux modernes. Et puis, gr&#xE2;ce &#xE0; <a href="http://github.com">Github</a> et son &quot;GitHub Flavored Markdown&quot;, le Mardown est conventionnellement utilis&#xE9; pour <strong>r&#xE9;diger</strong> la documentation technique d&apos;une librairie. Il est &#xE9;galement utilis&#xE9; comme langage de r&#xE9;daction par d&#xE9;faut de certains CMS comme <a href="https://ghost.org/">Ghost</a> ou <a href="http://anchorcms.com/">Anchor</a>. &#xC0; l&apos;heure actuelle, chaque langage de programmation dispose de son parseur et convertisseur Markdown pour HTML.</p>
<h2 id="quelques-exemples">Quelques exemples</h2>
<p>Alors vous me direz peut-&#xEA;tre que c&apos;est trop technique pour vous, pauvre profane des technologies web, mais vous vous trompez ! Ce langage est justement destin&#xE9; &#xE0; tout un chacun souhaitant formater manuellement et proprement son texte. Venons-en rapidement aux exemples concrets, si je souhaite ajouter un passage en gras dans un paragraphe, il me suffit d&apos;ajouter deux ast&#xE9;risques de chaque c&#xF4;t&#xE9; de mon segment.</p>
<p><strong>Exemple</strong> :</p>
<pre class="line-numbers"><code class="language-markdown">La th&#xE9;orie, c&apos;est quand on sait tout et que rien ne fonctionne. <span class="token bold"><span class="token punctuation">**</span>La pratique, c&apos;est quand tout fonctionne et que personne ne sait pourquoi<span class="token punctuation">**</span></span>. Si la pratique et la th&#xE9;orie sont r&#xE9;unies, rien ne fonctionne et on ne sait pas pourquoi.
</code></pre>
<p>Maintenant si vous souhaitez obtenir diff&#xE9;rents niveaux de titres, rien de plus simple, il vous suffit d&apos;ajouter devant chaque titre le nombre de di&#xE8;ses correspondant &#xE0; son niveau (jusqu&apos;&#xE0; six).</p>
<p><strong>Exemple</strong> :</p>
<pre class="line-numbers"><code class="language-markdown"><span class="token title important"><span class="token punctuation">#</span> Titre de niveau 1</span>
<span class="token title important"><span class="token punctuation">##</span> Titre de niveau 2</span>
<span class="token title important"><span class="token punctuation">###</span> Titre de niveau 3</span>
</code></pre>
<p>Vous pourrez trouver la liste compl&#xE8;te des toutes les possibilit&#xE9;s dans <a href="https://guides.github.com/features/mastering-markdown/">le guide de Github</a>.</p>
<h2 id="go-d-part-">Go d&#xE9;part !</h2>
<p>J&apos;esp&#xE8;re avoir largement convaincu ceux qui ne l&apos;utilisait pas encore, car personnellement je trouve que ce langage, &#xE0; la port&#xE9;e de tous, m&#xE9;rite clairement qu&apos;on s&apos;y int&#xE9;resse. En effet, apr&#xE8;s quelques minutes de prise en main, vous pourrez facilement mettre en page tout type de contenu sans ne plus jamais avoir &#xE0; faire avec l&apos;interface chaotique de Microsoft Word.</p>
<p><a href="http://antistatique.net/blog/2014/06/06/optez-pour-le-markdown/">Retrouver cet article sur le blog d&apos;Antistatique !</a></p>

    </article>
  </div>


    <script src="/js/vendors.min.js"></script>
  </body>
</html>
